{
  "title": "About",
  "history": [
    "The journey of JEC Roboworld began with the vision of the Team of Talented Individuals (TTI), led by Priyam Pratim Das (Founding Member & First Coordinator) along with batchmates Samarjyoti Deka (Mech 2007–11) and Shekhar Limbu (CSE 2007–11). Until PHOENIX 2010, JEC had no official robotics club, and robotics was just an event in the techno-cultural fest. Inspired by their participation and achievements at Techniche, IIT Guwahati (2009 & 2010) and securing 2nd and 1st positions in PHOENIX 09 & 10, they decided to form a dedicated club to spread robotics awareness. To attract students, they first organized a two-day workshop on Information Security & Ethical Hacking in collaboration with Appin Technology Lab, Guwahati. Despite having no funds, the team promoted the event across hostels and nearby institutes like POWIET, J.B. College, and Jorhat Institute of Science & Technology, eventually registering 58 participants. With the support of Dr. Atul Bora, Principal of JEC, and the cooperation of Appin Technology Lab, the workshop was successfully held on 31st March 2011, marking the official birth of JEC Roboworld, complete with club ID cards and pens issued to participants.",
    "Building on this success, the team set their focus back on robotics and collaborated with Robosapiens India, Noida, a leader in robotics and embedded systems, to conduct another two-day workshop. Without funds for publicity or hospitality, they arranged accommodation for the faculty in Hostel 7 and designed their own workshop banners. With the support of their batchmates and permission from Dr. Atul Bora, they registered over 60 participants, and on 30th April 2011, organized the Vision Robotricks Workshop. Students learned about MATLAB, microcontrollers, and laser-guided robots and even received free kits worth ₹3500 at a joining fee of ₹1200. These workshops laid the foundation of the club, which continued with in-house learning and activities. At the end of the 2010–11 session, the coordinatorship was handed over to Pranab Deka (CSE, H-1) as Coordinator, Dwanel Barman (Elec, H-7) as First Joint Coordinator, and Dipankar Bora (CSE, H-7) as Second Joint Coordinator. Priyam Pratim Das extended his heartfelt gratitude to Dr. Atul Bora, mentors Shri Abhineet Baruah and Shri Pranjal Pratim Baruah, teammates Samarjyoti Deka and Shekhar Limbu, the core team of 2010–11, and especially the boarders of Hostel 7 (notably Nabinder Singh & team) for their help in promoting the workshops. What started as a dream turned into a reality, and today, JEC Roboworld continues to evolve as a never-ending journey of sharing robotics knowledge and innovation at Jorhat Engineering College."
  ],
  "images": [
    {
      "url": "/assets/timeline/hobby_center.jpg",
      "caption": "RoboWorld lab and workspace"
    },
    {
      "url": "/assets/timeline/engineers_day.jpg",
      "caption": "Annual club gathering and project showcase"
    }
  ]
}